a = int(input("შეიყვანეთ რიცხვი 1-დან 10-მდე: "))
if a == 2 or a == 4  or a == 8 :
    print("2.", "ასნა:", int(a),"იყოფა 2-ზე, 2 არის მარტივი რიცხვი")
elif a == 3 or a == 9:
    print("3.", "ახსნა:", int(a), "იყოფა 3-ზე, 3 არის მარტივი რიცხვი ")
elif a == 5:
    print("5. ახსნა:", int(a)," იყოფა 5-ზე.", "5 არის მარტივი რიცხვი")
elif a == 7:
    print("7, ახსნა: 7 იყოფა 7-ზე. 7 არის მარტივი რიცხვი ")
elif a == 6:
    print("2, 3. ახსნა: 6 იყოფა 2-ზეც და 3-ზეც. 2 და 3 არის მარტივი რიცხვები")
elif a == 10:
    print("2 , 5. ახსნა : 10 იყოფა 2-ზე და 5-ზე. 2 და 5 არის მარტივი რიცხვები")
else :
    print("გთხოვთ შეიყვანეთ რიცხვი 1-დან 10-მდე")